![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/1200px-Pandas_logo.svg.png)

# <center> LESSON 5: Introduction to PANDAS </center>

## 1. INTRODUCTION

### 1.1 What is Pandas?

`Pandas = Panel Data`

Working with Structured Data (excel, csv, txt, time series,...)<br/>
Visualizing data

### 1.2 Installation

- Cài đặt khi tạo môi trường ảo:
```
conda create -n hanh python=3.7 pandas
```
- Cài đặt sau khi tạo xong môi trường ảo:
```
conda install pandas
```
hoặc 
```
pip install pandas
```

### 1.3 Import

In [2]:
import pandas as pd

**Reference**: 
- [Pandas Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
- [Python for Data Analysis](https://bedford-computing.co.uk/learning/wp-content/uploads/2015/10/Python-for-Data-Analysis.pdf)

## 2. BASICS

### 2.1 Objects in Pandas

- **DataFrame**: table, `pd.DataFrame()`
- **Series**: column, `pd.Series()`

![](https://media.geeksforgeeks.org/wp-content/cdn-uploads/creating_dataframe1.png)
![](https://analyticssavvy.com/wp-content/uploads/2020/05/series-and-dataframe.png)

#### 2.1.1 How to create a DataFrame

1. Tạo ra 1 DataFrame rỗng

In [3]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df)

pandas.core.frame.DataFrame

2. Tạo ra 1 DataFrame từ dict

In [19]:
dict1 = {'name':['Hanh', 'Mai', 'Cuong', 'Tung', 'Huong', 'Minh'], 'age':[25,25,24,27,34,26], 'university':['USTH', 'FTU', 'HAU', 'NEU', 'AOF', 'HUST']}
df1 = pd.DataFrame(dict1,index=[f'student{i}' for i in range(1,7)]) # f' means float
df1

           name  age university
student1   Hanh   25       USTH
student2    Mai   25        FTU
student3  Cuong   24        HAU
student4   Tung   27        NEU
student5  Huong   34        AOF
student6   Minh   26       HUST

3. Tạo ra 1 DataFrame từ list của list

In [22]:
li = [['Hanh',25,'USTH'],['Mai',25,'FTU'],['Cuong',24,'HAU'],['Tung',27,'NEU'],['Huong',34,'AOF'],['Minh',26,'HUST']]
df2 = pd.DataFrame(li, columns=['name','age','university'])
df2

    name  age university
0   Hanh   25       USTH
1    Mai   25        FTU
2  Cuong   24        HAU
3   Tung   27        NEU
4  Huong   34        AOF
5   Minh   26       HUST

4. Tạo ra 1 DataFrame từ zip

In [26]:
# zip = match tung elements tren lists
name = ['Hanh', 'Mai', 'Cuong', 'Tung', 'Huong', 'Minh']
age = [25,25,24,27,34,26]
university = ['USTH', 'FTU', 'HAU', 'NEU', 'AOF', 'HUST']
df3 = pd.DataFrame(list(zip(name,age,university)))
df3

       0   1     2
0   Hanh  25  USTH
1    Mai  25   FTU
2  Cuong  24   HAU
3   Tung  27   NEU
4  Huong  34   AOF
5   Minh  26  HUST

5. Tạo từ 1 chuỗi numpy

In [27]:
import numpy as np
df4 = pd.DataFrame(np.linspace(1,16,16).reshape(4,4))
df4

      0     1     2     3
0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0
2   9.0  10.0  11.0  12.0
3  13.0  14.0  15.0  16.0

#### 2.1.2 How to create a Series

In [30]:
type(pd.Series({'name':['Hanh', 'Mai', 'Cuong', 'Tung', 'Huong', 'Minh']}))

pandas.core.series.Series

In [32]:
df2['name']

0     Hanh
1      Mai
2    Cuong
3     Tung
4    Huong
5     Minh
Name: name, dtype: object

In [33]:
df2.name

0     Hanh
1      Mai
2    Cuong
3     Tung
4    Huong
5     Minh
Name: name, dtype: object

### 2.2 Indexing

Chọn tất cả các dòng (slicing):
- `loc`: location `df.loc[row_label,col_label]`, `series.loc[row_label]`
- `iloc`: index location `df.iloc[row_index,col_index]`, `series.iloc[row_index]`

Chọn 1 cell:
- `at`:  `df.at[row_label,col_label]`
- `iat`: `df.iat[row_index,col_index]`

### 2.3 Masking

### 2.4 I/O

Link: https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data

**Read**: `pd.read_{ten_kieu_file}: pd.read_csv(), pd.read_sql()`<br/>
**Save**: `pd.to_{ten_kieu_file}: pd.to_csv(), pd.to_excel()`

.csv = commas seperated value<br/>
.tsv = tab seperated value<br/>
.txt

In [36]:
df = pd.read_csv('Ecommerce Purchases')
df.head(5) 
#df.tail(5): doc 5 dong cuoi trong df
#df.sample(5): doc random 5 dong trong df

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [40]:
iris = pd.read_csv('iris.data',header=None)
iris.head(5)

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [41]:
iris = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data',header=None)
iris.head(5)

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [44]:
import seaborn as sns
iris2 = sns.load_dataset('iris')
iris2.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### 2.5 Operations

#### 2.5.1 Groupby

![](https://blog.dask.org/images/split-apply-combine.png)

#### 2.5.2 Pivot

#### 2.5.3 Others

|Merge methods| SQL Join Name | Meaning| _merge|
|-|-|-|-|
|left| LEFT OUTER JOIN|Chỉ sử dụng keys bên trái|left_only|
|right| RIGHT OUTER JOIN|Chỉ sử dụng keys bên phải|right_only|
|outer|FULL OUTER JOIN|Sử dụng keys của cả 2 dataframes|both|
|inner|INNER JOIN|Chỉ sử dụng keys giao nhau của 2 dataframes|both|

![](https://lh3.googleusercontent.com/-n76c6dtr5sw/YBO5d-3PzGI/AAAAAAAAAh8/xiT6YIzePLEXArb8uU1f1vgg8JRXYeg8ACLcBGAsYHQ/image.png)